tests/Integration/__fixtures__/stripe_invoice_payment_succeed.json

{"id": "evt_1NWX0RBGIr5C5v4TpncL2sCf", "data": {"object": {"id": "in_1NVRYnBGIr5C5v4T6gwKxkt9", "tax": 3427, "paid": true, "lines": {"url": "/v1/invoices/in_1NVRYnBGIr5C5v4T6gwKxkt9/lines", "data": [{"id": "il_1NVRYnBGIr5C5v4T7ghcYILT", "plan": null, "type": "invoiceitem", "price": {"id": "price_1NQOl7BGIr5C5v4TX4CGTDgd", "type": "one_time", "active": false, "object": "price", "created": 1688536813, "product": "prod_OAvQ2QqE5w9qqQ", "currency": "aud", "livemode": false, "metadata": {}, "nickname": null, "recurring": null, "lookup_key": null, "tiers_mode": null, "unit_amount": 34268, "tax_behavior": "unspecified", "billing_scheme": "per_unit", "custom_unit_amount": null, "transform_quantity": null, "unit_amount_decimal": "34268"}, "amount": 34268, "object": "line_item", "period": {"end": 1689739221, "start": 1689739221}, "currency": "aud", "livemode": false, "metadata": {}, "quantity": 1, "discounts": [], "proration": false, "tax_rates": [{"id": "txr_1NLLgXBGIr5C5v4TqHwHWSn6", "state": null, "active": true, "object": "tax_rate", "country": null, "created": 1687333357, "livemode": false, "metadata": {}, "tax_type": null, "inclusive": false, "percentage": 10, "description": "Default 10% GST exclusive tax rate", "display_name": "GST", "jurisdiction": null, "effective_percentage": 10}], "description": "Same Day", "tax_amounts": [{"amount": 3427, "tax_rate": "txr_1NLLgXBGIr5C5v4TqHwHWSn6", "inclusive": false, "taxable_amount": 34268, "taxability_reason": null}], "discountable": true, "invoice_item": "ii_1NVRYnBGIr5C5v4Trb8RU9Nn", "subscription": null, "discount_amounts": [], "proration_details": {"credited_items": null}, "amount_excluding_tax": 34268, "unit_amount_excluding_tax": "34268"}], "object": "list", "has_more": false, "total_count": 1}, "quote": null, "total": 37695, "charge": "ch_3NVRYoBGIr5C5v4T1EcxOREM", "footer": null, "number": "60FF5552-0113", "object": "invoice", "status": "paid", "created": 1689739221, "currency": "aud", "customer": "cus_O9rUsymo0k47a9", "discount": null, "due_date": null, "livemode": false, "metadata": {}, "subtotal": 34268, "attempted": true, "discounts": [], "amount_due": 37695, "period_end": 1691047938, "test_clock": null, "amount_paid": 37695, "application": null, "description": null, "invoice_pdf": "https://pay.stripe.com/invoice/acct_1MU0uJBGIr5C5v4T/test_YWNjdF8xTVUwdUpCR0lyNUM1djRULF9PSTFjMkZLR3JtVWx3bXZ0VEtUUkNDY01aYzJ4d25aLDgwNTM5Mjgz0200FrAxVg6v/pdf?s=ap", "account_name": "SHIPSAAS", "auto_advance": false, "effective_at": 1689739221, "from_invoice": null, "on_behalf_of": null, "period_start": 1688369538, "subscription": null, "attempt_count": 1, "automatic_tax": {"status": null, "enabled": false}, "custom_fields": null, "customer_name": "The Customer PRO", "shipping_cost": null, "transfer_data": null, "billing_reason": "manual", "customer_email": null, "customer_phone": null, "default_source": null, "ending_balance": 0, "payment_intent": "pi_3NVRYoBGIr5C5v4T1Wuq47lN", "receipt_number": null, "account_country": "AU", "account_tax_ids": null, "amount_shipping": 0, "latest_revision": null, "amount_remaining": 0, "customer_address": null, "customer_tax_ids": [], "paid_out_of_band": false, "payment_settings": {"default_mandate": null, "payment_method_types": null, "payment_method_options": null}, "shipping_details": null, "starting_balance": 0, "collection_method": "charge_automatically", "customer_shipping": null, "default_tax_rates": [{"id": "txr_1NLLgXBGIr5C5v4TqHwHWSn6", "state": null, "active": true, "object": "tax_rate", "country": null, "created": 1687333357, "livemode": false, "metadata": {}, "tax_type": null, "inclusive": false, "percentage": 10, "description": "Default 10% GST exclusive tax rate", "display_name": "GST", "jurisdiction": null, "effective_percentage": 10}], "rendering_options": null, "total_tax_amounts": [{"amount": 3427, "tax_rate": "txr_1NLLgXBGIr5C5v4TqHwHWSn6", "inclusive": false, "taxable_amount": 34268, "taxability_reason": null}], "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1MU0uJBGIr5C5v4T/test_YWNjdF8xTVUwdUpCR0lyNUM1djRULF9PSTFjMkZLR3JtVWx3bXZ0VEtUUkNDY01aYzJ4d25aLDgwNTM5Mjgz0200FrAxVg6v?s=ap", "status_transitions": {"paid_at": 1689998481, "voided_at": null, "finalized_at": 1689739221, "marked_uncollectible_at": null}, "customer_tax_exempt": "none", "total_excluding_tax": 34268, "next_payment_attempt": null, "statement_descriptor": null, "webhooks_delivered_at": null, "application_fee_amount": null, "default_payment_method": null, "subtotal_excluding_tax": 34268, "total_discount_amounts": [], "last_finalization_error": null, "pre_payment_credit_notes_amount": 0, "post_payment_credit_notes_amount": 0}}, "type": "invoice.payment_succeeded", "object": "event", "created": 1689998483, "request": {"id": null, "idempotency_key": null}, "livemode": false, "api_version": "2022-11-15", "pending_webhooks": 2}
